In [18]:
import pandas as pd
import seaborn as sns
import numpy as np

In [3]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [4]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [7]:
# 각각의 column을 그룹화 해서 보여줌
df['species'].value_counts()

virginica     50
versicolor    50
setosa        50
Name: species, dtype: int64

In [10]:
# column의 개수를 보여줌
len(df)

150

In [13]:
# dafaframe의 행과 열을 가지고 옴
df.shape

(150, 5)

In [14]:
# column의 distinct 한 개수
df['species'].nunique()

3

In [16]:
# 수치적 data의 통계적 수치
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [17]:
# 모든 data의 수치
# object, number 등으로 각각 분류해서 data 확인 가능
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [20]:
df.describe(include=[np.object])

<ipython-input-20-554b7518cb2b>:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df.describe(include=[np.object])

          species
count         150
unique          3
top     virginica
freq           50

In [22]:
# column의 합계
df['petal_width'].sum()

179.90000000000003

In [23]:
# column의 data 개수
df['petal_width'].count()

150

In [24]:
# column의 중앙값
df['petal_width'].median()

1.3

In [25]:
# column의 평균
df['petal_width'].mean()

1.199333333333334

In [26]:
# column의 사분위수
df.quantile([0.25, 0.75])

      sepal_length  sepal_width  petal_length  petal_width
0.25           5.1          2.8           1.6          0.3
0.75           6.4          3.3           5.1          1.8

In [28]:
# column의 최대값
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [29]:
# column의 최소값
df.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [30]:
# column의 분산
df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [31]:
# column의 표준편차
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [32]:
# 익명 함수를 이용하여 전처리
df.apply(lambda x : x[2])

sepal_length       4.7
sepal_width        3.2
petal_length       1.3
petal_width        0.2
species         setosa
dtype: object

In [33]:
# 뒤에서 3번째까지의 문자를 가져오는 함수
def smp(x) : 
    x = x[-3:]
    return x

In [35]:
# 외부 함수를 이용하여 전처리
df['species'].apply(smp)

0      osa
1      osa
2      osa
3      osa
4      osa
      ...
145    ica
146    ica
147    ica
148    ica
149    ica
Name: species, Length: 150, dtype: object